# 저장장치 및 파일

## 9.1 저장장치의 종류

### 9.1.1 순차접근 저장장치

1. 순차접근 저장장치
    - 순차적으로 기록 및 판독을 하는 저장장치
    - 예 : 테이프 장치
    - 초기 접근시간이 굉장히 오래 걸림
    - 대량의 데이터 백업용으로 사용됨

### 9.1.2 직접접근 저장장치

1. 직접접근 저장장치
    - 위치를 지정하여 데이터를 직접 읽거나 쓸 수 있는 장치
    - 임의접근 저장장치
2. 자기 디스크
    - 구성 : 한 장 이상의 플래터, 헤드, 암
    - 트랙 : 플래터의 중심축을 기준으로한 동심원 형태
    - 섹터 : 트랙을 분할하여 일정한 용량을 저장할 수 있는 호 형태
    - 실린더 : 플래터가 여러 장인 경우 중심축으로부터 같은 거리에 있는 트랙들의 모음
    - 동작 : 헤드를 원하는 트랙으로 이동 → 헤드에 원하는 섹터가 오도록 플래터를 회전시킴
3. 광디스크
    - 디스크 표면에 레이저를 쏘아 반사되는 빛의 차이를 이용
    - 나선형인 하나의 트랙으로 구성
4. SSD
    - 읽고 쓰기가 가능하면서 전력공급 없이도 데이터가 지워지지 않는 메모리를 이용
    - 자기 디스크보다 속도가 빠르고 전력소모가 적음
    - 자기 디스크보다 가격이 비싸며 수명이 짧음

## 9.2 디스크 스케줄링

1. 디스크 스케줄링
    - 디스크 접근 요구를 효율적으로 처리하는 순서를 결정하는 작업
    - 프로세스들의 요구를 디스크 큐에 두고 관리
    - 기계적 동작이 최소화되도록 디스크 큐를 재배열
2. 자기 디스크의 접근시간 : 탐구시간 + 회전지연시간 + 전송시간
    - 탐구시간 : 기계적인 동작에 의해 읽기/쓰기 헤드를 원하는 트랙에 위치시키는 시간. 가장 느림
    - 회전지연시간 : 요구된 자료가 읽기/쓰기 밑에 이를 때까지 디스크를 회전하는데 걸리는 시간
    - 전송시간 : 자료가 보조 기억장치에서 주기억 장치로 이동하는데 걸리는 시간. 가장 빠름
3. 스케줄링 형태
    - 탐구시간 최적화 : 대부분의 알고리즘
    - 회전지연시간 최적화

### 9.2.1 FCFS 스케줄링

1. FCFS(First Come First Serve) 스케줄링
    - 먼저 도착한 요구가 먼저 서비스를 받는 방법
2. 문제점
    - 요구들의 도착순서에 따라 헤드의 이동거리가 길어질 수 있음
    - 디스크 부하가 커질수록 응답시간이 길어짐

### 9.2.2 SSTF 스케줄링

1. SSTF(Shortest-Seek-Time-First) 스케줄링
    - 최단 탐구시간을 가져오는 요구를 먼저 처리하는 방법
2. 문제점
    - 트랙의 위치에 따라 응답시간에 큰 편차

### 9.2.3 SCAN 스케줄링(Elevator)

1. SCAN 스케줄링
    - 선택된 방향에서 최단 탐구시간을 가져오는 요구를 선택하는 방법
    - 진행 방향으로 더 이상 요구가 없더라도 항상 최외곽 혹은 최내각 실린더까지 도달한 후 방향을 바꿈
2. 문제점
    - 새로운 요구가 헤드 진행 방향 바로 앞이냐 바로 뒤냐에 따라 대기시간의 편차가 큼

### 9.2.4 N-Step SCAN 스케줄링

1. N-Step SCAN 스케줄링
    - 특정한 방향의 진행이 시작될 때 대기중이던 요구들만 서비스
    - 나머지는 SCAN과 동일
2. 특징
    - 처리량과 응답시간이 좋음
    - SSTF나 SCAN보다 응답시간의 편차가 적음

### 9.2.5 C-SCAN 스케줄링

1. C-SCAN 스케줄링
    - 바깥쪽이든 안쪽이든 오로지 한쪽 방향으로만 서비스
    - 나머지는 SCAN과 동일
2. 특징
    - 응답시간의 편차가 매우 작음
    - 현재 진행 중에 도착한 요구는 다음 진행 때 서비스 되도록 구현 가능

### 9.2.6 LOCK 및 C-LOCK 스케줄링

1. LOCK 및 C-LOCK 스케줄링
    - 진행 방향으로 더 이상 요구가 없으면 방향을 바꿈
    - 나머지는 LOCK은 SCAN, C-LOCK은 C-SCAN과 동일

### 9.2.7 SLTF 스케줄링

1. SLTP(Shortest Latency Time First) 스케줄링
    - 동일 실린더 내의 요구 중 회전지연시간이 가장 짧은 것을 먼저 처리
2. 특징
    - 이론적인 최적치와 거의 일치

## 9.3 파일 관리

### 9.3.1 파일 관리자의 요소

1. 파일 관리자의 요소
    - 액세스 방식 : 파일에 저장되어 있는 데이터에 접근하는 방식
    - 파일 관리 : 파일을 저장, 참조, 공유  수 있도록 하며 안전하게 보호될 수 있도록 함
    - 보조기억장치 관리 : 보조기억장치에 파일을 저장하는 데 필요한 공간을 할당
    - 파일 무결성 유지 : 파일의 정보가 소실되지 않도록 보장

### 9.3.2 파일 관리자의 기능

1. 파일 관리자의 기능
    - 적절한 보조기억장치를 활성화 시켜 파일을 할당
    - 파일의 기록을 갱신하는 동안에는 파일을 메모리에 적재
    - 테이블을 갱신하거나 수정된 사항이 있다면 파일을 보조기억장치와 같은 장소에 다시 쓰고 그 파일을 해지

### 9.3.3 파일 구조와 접근 방식

1. 순차 파일
    - 레코드가 물리적 순서에 따라 저장되어 있는 파일
    - 순차접근 저장장치에 많이 이용
2. 인덱스된 순차 파일
    - 레코드가 각 레코드의 키를 기준으로 한 논리적 순서대로 배열되어 있는 파일
    - 키 순서에 의한 순차접근과 시스템에 의해 생성된 인덱스의 검색을 통한 직접접근 모두 가능
3. 직접 파일
    - 레코드의 주소를 이용하여 직접 접근되는 파일

### 9.3.4 디스크 공간 할당

1. 연속 할당 기법
    - 파일을 보조 기억장치의 연속된 공간에 할당
    - 생성하려는 파일의 저장공간의 크기를 미리 정해야 함
    - 장점 : 엑세스 시간 짧음, 디렉토리 구현 단순
    - 단점 : 외부 단편화, 파일 크기 변화에 따른 대응이 비효율적
    
2. 불연속 할당 기법
    - 섹터 또는 정해진 수의 섹터로 구성된 블록 단위로 공간을 할당
    - 포인터를 이용하여 블록들을 연결 관리
    - 장점 : 연속 할당 기법의 단점을 해결
    - 파일 공간 분산으로 성능 저하 발생, 포인터 관리를 위한 연산 및 공간 소비
